{"F16K": "VALVES", "F23R": "GENERATING COMBUSTION PRODUCTS OF HIGH PRESSURE OR HIGH VELOCITY, e.g. GAS-TURBINE COMBUSTION CHAMBERS", "A47B": "TABLES", "D06M": "TREATMENT, NOT PROVIDED FOR ELSEWHERE IN CLASS", "G11B": "INFORMATION STORAGE BASED ON RELATIVE MOVEMENT BETWEEN RECORD CARRIER AND TRANSDUCER", "B33Y": "ADDITIVE MANUFACTURING, i.e. MANUFACTURING OF THREE-DIMENSIONAL [3-D] OBJECTS BY ADDITIVE DEPOSITION, ADDITIVE AGGLOMERATION OR ADDITIVE LAYERING, e.g. BY 3-D PRINTING, STEREOLITHOGRAPHY OR SELECTIVE LASER SINTERING", "B31D": "MAKING ARTICLES OF PAPER, CARDBOARD OR MATERIAL WORKED IN A MANNER ANALOGOUS TO PAPER, NOT PROVIDED FOR IN SUBCLASSES", "A23L": "FOODS, FOODSTUFFS, OR NON-ALCOHOLIC BEVERAGES, NOT COVERED BY SUBCLASSES", "B63C": "LAUNCHING, HAULING-OUT, OR DRY-DOCKING OF VESSELS", "G01K": "MEASURING TEMPERATURE", "G08B": "SIGNALLING OR CALLING SYSTEMS", "A23P": "SHAPING OR WORKING OF FOODSTUFFS, NOT FULLY COVERED BY A SINGLE OTHER SUBCLASS", "C08C": "TREATMENT OR CHEMICAL MODIFICATION OF RUBBERS", "B60J": "WINDOWS, WINDSCREENS, NON-FIXED ROOFS, DOORS, OR SIMILAR DEVICES FOR VEHICLES", "B03B": "SEPARATING SOLID MATERIALS USING LIQUIDS OR USING PNEUMATIC TABLES OR JIGS", "B05D": "PROCESSES FOR APPLYING FLUENT MATERIALS TO SURFACES, IN GENERAL", "A46D": "MANUFACTURE OF BRUSHES", "F01D": "NON-POSITIVE DISPLACEMENT MACHINES OR ENGINES, e.g. STEAM TURBINES", "B60G": "VEHICLE SUSPENSION ARRANGEMENTS", "H03C": "MODULATION", "B23P": "METAL-WORKING NOT OTHERWISE PROVIDED FOR", "H01H": "ELECTRIC SWITCHES", "G04F": "TIME-INTERVAL MEASURING", "G21C": "NUCLEAR REACTORS", "C01P": "INDEXING SCHEME RELATING TO STRUCTURAL AND PHYSICAL ASPECTS OF SOLID INORGANIC COMPOUNDS", "F02P": "IGNITION, OTHER THAN COMPRESSION IGNITION, FOR INTERNAL-COMBUSTION ENGINES", "C25F": "PROCESSES FOR THE ELECTROLYTIC REMOVAL OF MATERIALS FROM OBJECTS", "E01C": "CONSTRUCTION OF, OR SURFACES FOR, ROADS, SPORTS GROUNDS, OR THE LIKE", "A63B": "APPARATUS FOR PHYSICAL TRAINING, GYMNASTICS, SWIMMING, CLIMBING, OR FENCING", "C10L": "FUELS NOT OTHERWISE PROVIDED FOR", "A47F": "SPECIAL FURNITURE, FITTINGS, OR ACCESSORIES FOR SHOPS, STOREHOUSES, BARS, RESTAURANTS OR THE LIKE", "B67B": "APPLYING CLOSURE MEMBERS TO BOTTLES JARS, OR SIMILAR CONTAINERS", "F21V": "FUNCTIONAL FEATURES OR DETAILS OF LIGHTING DEVICES OR SYSTEMS THEREOF", "C40B": "COMBINATORIAL CHEMISTRY", "C10J": "PRODUCTION OF PRODUCER GAS, WATER-GAS, SYNTHESIS GAS FROM SOLID CARBONACEOUS MATERIAL, OR MIXTURES CONTAINING THESE GASES", "C09G": "POLISHING COMPOSITIONS", "H01K": "ELECTRIC INCANDESCENT LAMPS", "B41L": "APPARATUS OR DEVICES FOR MANIFOLDING, DUPLICATING OR PRINTING FOR OFFICE OR OTHER COMMERCIAL PURPOSES", "B43L": "ARTICLES FOR WRITING OR DRAWING UPON;", "B07B": "SEPARATING SOLIDS FROM SOLIDS BY SIEVING, SCREENING, SIFTING OR BY USING GAS CURRENTS", "A24F": "SMOKERS' REQUISITES", "A43C": "FASTENINGS OR ATTACHMENTS OF FOOTWEAR", "B66B": "ELEVATORS", "D01G": "PRELIMINARY TREATMENT OF FIBRES, e.g. FOR SPINNING", "F16G": "BELTS, CABLES, OR ROPES, PREDOMINANTLY USED FOR DRIVING PURPOSES", "H04H": "BROADCAST COMMUNICATION", "C25D": "PROCESSES FOR THE ELECTROLYTIC OR ELECTROPHORETIC PRODUCTION OF COATINGS", "G01C": "MEASURING DISTANCES, LEVELS OR BEARINGS", "E04D": "ROOF COVERINGS", "C09J": "ADHESIVES", "B66D": "CAPSTANS", "B60B": "VEHICLE WHEELS", "A23C": "DAIRY PRODUCTS, e.g. MILK, BUTTER OR CHEESE", "F26B": "DRYING SOLID MATERIALS OR OBJECTS BY REMOVING LIQUID THEREFROM", "G07B": "TICKET-ISSUING APPARATUS", "E05F": "DEVICES FOR MOVING WINGS INTO OPEN OR CLOSED POSITION", "E01D": "CONSTRUCTION OF BRIDGES,", "B65B": "MACHINES, APPARATUS OR DEVICES FOR, OR METHODS OF, PACKAGING ARTICLES OR MATERIALS", "B60Q": "ARRANGEMENT OF SIGNALLING OR LIGHTING DEVICES, THE MOUNTING OR SUPPORTING THEREOF OR CIRCUITS THEREFOR, FOR VEHICLES IN GENERAL", "C09K": "MATERIALS FOR MISCELLANEOUS APPLICATIONS, NOT PROVIDED FOR ELSEWHERE", "G05F": "SYSTEMS FOR REGULATING ELECTRIC OR MAGNETIC VARIABLES", "B63J": "AUXILIARIES ON VESSELS", "F16P": "SAFETY DEVICES IN GENERAL;", "G16Z": "INFORMATION AND COMMUNICATION TECHNOLOGY [ICT] SPECIALLY ADAPTED FOR SPECIFIC APPLICATION FIELDS, NOT OTHERWISE PROVIDED FOR", "H02K": "DYNAMO-ELECTRIC MACHINES", "H03D": "DEMODULATION OR TRANSFERENCE OF MODULATION FROM ONE CARRIER TO ANOTHER", "F24T": "GEOTHERMAL COLLECTORS", "B21K": "MAKING FORGED OR PRESSED METAL PRODUCTS, e.g. HORSE-SHOES, RIVETS, BOLTS OR WHEELS", "B04B": "CENTRIFUGES", "B23B": "TURNING", "B08B": "CLEANING IN GENERAL", "G08G": "TRAFFIC CONTROL SYSTEMS", "A01C": "PLANTING", "H01B": "CABLES", "B41P": "INDEXING SCHEME RELATING TO PRINTING, LINING MACHINES, TYPEWRITERS, AND TO STAMPS", "B04C": "APPARATUS USING FREE VORTEX FLOW, e.g. CYCLONES", "A01K": "ANIMAL HUSBANDRY", "H01P": "WAVEGUIDES", "C25B": "ELECTROLYTIC OR ELECTROPHORETIC PROCESSES FOR THE PRODUCTION OF COMPOUNDS OR NON-METALS", "D03C": "SHEDDING MECHANISMS", "C22B": "PRODUCTION AND REFINING OF METALS", "B65F": "GATHERING OR REMOVAL OF DOMESTIC OR LIKE REFUSE", "G04B": "MECHANICALLY-DRIVEN CLOCKS OR WATCHES", "F03B": "MACHINES OR ENGINES FOR LIQUIDS", "A01F": "PROCESSING OF HARVESTED PRODUCE", "B62K": "CYCLES", "H02H": "EMERGENCY PROTECTIVE CIRCUIT ARRANGEMENTS", "B24C": "ABRASIVE OR RELATED BLASTING WITH PARTICULATE MATERIAL", "F41G": "WEAPON SIGHTS", "G07G": "REGISTERING THE RECEIPT OF CASH, VALUABLES, OR TOKENS", "D04H": "MAKING TEXTILE FABRICS, e.g. FROM FIBRES OR FILAMENTARY MATERIAL", "E21D": "SHAFTS", "F01M": "LUBRICATING OF MACHINES OR ENGINES IN GENERAL", "C05G": "MIXTURES OF FERTILISERS COVERED INDIVIDUALLY BY DIFFERENT SUBCLASSES OF CLASS", "C10B": "DESTRUCTIVE DISTILLATION OF CARBONAGEOUS MATERIALS FOR PRODUCTION OF GAS, COKE, TAR, OR SIMILAR MATERIALS", "F02F": "CYLINDERS, PISTONS OR CASINGS, FOR COMBUSTION ENGINES", "C12Y": "ENZYMES", "B82B": "NANOSTRUCTURES FORMED BY MANIPULATION OF INDIVIDUAL ATOMS, MOLECULES, OR LIMITED COLLECTIONS OF ATOMS OR MOLECULES AS DISCRETE UNITS", "A24C": "MACHINES FOR MAKING CIGARS OR CIGARETTES", "E04C": "STRUCTURAL ELEMENTS", "C10K": "PURIFYING OR MODIFYING THE CHEMICAL COMPOSITION OF COMBUSTIBLE GASES CONTAINING CARBON MONOXIDE", "D06B": "TREATING TEXTILE MATERIALS USING LIQUIDS, GASES OR VAPOURS", "B67D": "DISPENSING, DELIVERING OR TRANSFERRING LIQUIDS, NOT OTHERWISE PROVIDED FOR", "D21G": "CALENDERS", "E05D": "HINGES OR SUSPENSION DEVICES FOR DOORS, WINDOWS OR WINGS", "G06K": "GRAPHICAL DATA READING", "A47D": "FURNITURE SPECIALLY ADAPTED FOR CHILDREN", "F16C": "SHAFTS", "F01B": "MACHINES OR ENGINES, IN GENERAL OR OF POSITIVE-DISPLACEMENT TYPE, e.g. STEAM ENGINES", "A01B": "SOIL WORKING IN AGRICULTURE OR FORESTRY", "C07H": "SUGARS", "A44C": "PERSONAL ADORNMENTS, e.g. JEWELLERY", "G04D": "APPARATUS OR TOOLS SPECIALLY DESIGNED FOR MAKING OR MAINTAINING CLOCKS OR WATCHES", "B64F": "GROUND OR AIRCRAFT-CARRIER-DECK INSTALLATIONS SPECIALLY ADAPTED FOR USE IN CONNECTION WITH AIRCRAFT", "A45B": "WALKING STICKS", "B64C": "AEROPLANES", "E06B": "FIXED OR MOVABLE CLOSURES FOR OPENINGS IN BUILDINGS, VEHICLES, FENCES OR LIKE ENCLOSURES IN GENERAL, e.g. DOORS, WINDOWS, BLINDS, GATES", "E05Y": "INDEXING SCHEME RELATING TO HINGES OR OTHER SUSPENSION DEVICES FOR DOORS, WINDOWS OR WINGS AND DEVICES FOR MOVING WINGS INTO OPEN OR CLOSED POSITION, CHECKS FOR WINGS AND WING FITTINGS NOT OTHERWISE PROVIDED FOR, CONCERNED WITH THE FUNCTIONING OF THE WING", "Y02A": "TECHNOLOGIES FOR ADAPTATION TO CLIMATE CHANGE", "A47J": "KITCHEN EQUIPMENT", "H03L": "AUTOMATIC CONTROL, STARTING, SYNCHRONISATION, OR STABILISATION OF GENERATORS OF ELECTRONIC OSCILLATIONS OR PULSES", "H01R": "ELECTRICALLY-CONDUCTIVE CONNECTIONS", "B31B": "MAKING CONTAINERS OF PAPER, CARDBOARD OR MATERIAL WORKED IN A MANNER ANALOGOUS TO PAPER", "D06P": "DYEING OR PRINTING TEXTILES", "B60K": "ARRANGEMENT OR MOUNTING OF PROPULSION UNITS OR OF TRANSMISSIONS IN VEHICLES", "F02M": "SUPPLYING COMBUSTION ENGINES IN GENERAL WITH COMBUSTIBLE MIXTURES OR CONSTITUENTS THEREOF", "B31F": "MECHANICAL WORKING OR DEFORMATION OF PAPER, CARDBOARD OR MATERIAL WORKED IN A MANNER ANALOGOUS TO PAPER", "F01C": "ROTARY-PISTON OR OSCILLATING-PISTON MACHINES OR ENGINES", "G02B": "OPTICAL ELEMENTS, SYSTEMS OR APPARATUS", "G01T": "MEASUREMENT OF NUCLEAR OR X-RADIATION", "F05D": "INDEXING SCHEME FOR ASPECTS RELATING TO NON-POSITIVE-DISPLACEMENT MACHINES OR ENGINES, GAS-TURBINES OR JET-PROPULSION PLANTS", "E04B": "GENERAL BUILDING CONSTRUCTIONS", "C01G": "COMPOUNDS CONTAINING METALS NOT COVERED BY SUBCLASSES", "F04C": "ROTARY-PISTON, OR OSCILLATING-PISTON, POSITIVE-DISPLACEMENT MACHINES FOR LIQUIDS", "A21D": "TREATMENT, e.g. PRESERVATION, OF FLOUR OR DOUGH, e.g. BY ADDITION OF MATERIALS", "B82Y": "SPECIFIC USES OR APPLICATIONS OF NANOSTRUCTURES", "F16M": "FRAMES, CASINGS OR BEDS OF ENGINES, MACHINES OR APPARATUS, NOT SPECIFIC TO ENGINES, MACHINES OR APPARATUS PROVIDED FOR ELSEWHERE", "B21J": "FORGING", "F27D": "DETAILS OR ACCESSORIES OF FURNACES, KILNS, OVENS, OR RETORTS, IN SO FAR AS THEY ARE OF KINDS OCCURRING IN MORE THAN ONE KIND OF FURNACE", "G05G": "CONTROL DEVICES OR SYSTEMS INSOFAR AS CHARACTERISED BY MECHANICAL FEATURES ONLY", "B29L": "INDEXING SCHEME ASSOCIATED WITH SUBCLASS", "C21B": "MANUFACTURE OF IRON OR STEEL", "B07C": "POSTAL SORTING", "A01N": "PRESERVATION OF BODIES OF HUMANS OR ANIMALS OR PLANTS OR PARTS THEREOF", "Y02D": "CLIMATE CHANGE MITIGATION TECHNOLOGIES IN INFORMATION AND COMMUNICATION TECHNOLOGIES [ICT], I.E. INFORMATION AND COMMUNICATION TECHNOLOGIES AIMING AT THE REDUCTION OF THEIR OWN ENERGY USE", "C12C": "BEER", "B41N": "PRINTING PLATES OR FOILS", "H02P": "CONTROL OR REGULATION OF ELECTRIC MOTORS, ELECTRIC GENERATORS OR DYNAMO-ELECTRIC CONVERTERS", "F27B": "FURNACES, KILNS, OVENS, OR RETORTS IN GENERAL", "A63C": "SKATES", "G01Q": "SCANNING-PROBE TECHNIQUES OR APPARATUS", "B60R": "VEHICLES, VEHICLE FITTINGS, OR VEHICLE PARTS, NOT OTHERWISE PROVIDED FOR", "G01S": "RADIO DIRECTION-FINDING", "G05D": "SYSTEMS FOR CONTROLLING OR REGULATING NON-ELECTRIC VARIABLES", "F15D": "FLUID DYNAMICS, i.e. METHODS OR MEANS FOR INFLUENCING THE FLOW OF GASES OR LIQUIDS", "F41B": "WEAPONS FOR PROJECTING MISSILES WITHOUT USE OF EXPLOSIVE OR COMBUSTIBLE PROPELLANT CHARGE", "F02C": "GAS-TURBINE PLANTS", "B23C": "MILLING", "B61D": "BODY DETAILS OR KINDS OF RAILWAY VEHICLES", "F23N": "REGULATING OR CONTROLLING COMBUSTION", "F41A": "FUNCTIONAL FEATURES OR DETAILS COMMON TO BOTH SMALLARMS AND ORDNANCE, e.g. CANNONS", "B41M": "PRINTING, DUPLICATING, MARKING, OR COPYING PROCESSES", "G03H": "HOLOGRAPHIC PROCESSES OR APPARATUS", "C11B": "PRODUCING, e.g. BY PRESSING RAW MATERIALS OR BY EXTRACTION FROM WASTE MATERIALS, REFINING OR PRESERVING FATS, FATTY SUBSTANCES, e.g. LANOLIN, FATTY OILS OR WAXES", "C05F": "ORGANIC FERTILISERS NOT COVERED BY SUBCLASSES", "F21L": "LIGHTING DEVICES OR SYSTEMS THEREOF, BEING PORTABLE OR SPECIALLY ADAPTED FOR TRANSPORTATION", "B81B": "MICROSTRUCTURAL DEVICES OR SYSTEMS, e.g. MICROMECHANICAL DEVICES", "H02S": "GENERATION OF ELECTRIC POWER BY CONVERSION OF INFRA-RED RADIATION, VISIBLE LIGHT OR ULTRAVIOLET LIGHT, e.g. USING PHOTOVOLTAIC [PV] MODULES", "A23G": "COCOA", "C03C": "CHEMICAL COMPOSITION OF GLASSES, GLAZES OR VITREOUS ENAMELS", "F02K": "JET-PROPULSION PLANTS", "H01T": "SPARK GAPS", "G01N": "INVESTIGATING OR ANALYSING MATERIALS BY DETERMINING THEIR CHEMICAL OR PHYSICAL PROPERTIES", "B25F": "COMBINATION OR MULTI-PURPOSE TOOLS NOT OTHERWISE PROVIDED FOR", "C01D": "COMPOUNDS OF ALKALI METALS, i.e. LITHIUM, SODIUM, POTASSIUM, RUBIDIUM, CAESIUM, OR FRANCIUM", "G10K": "SOUND-PRODUCING DEVICES", "H04L": "TRANSMISSION OF DIGITAL INFORMATION, e.g. TELEGRAPHIC COMMUNICATION", "H05B": "ELECTRIC HEATING", "G01W": "METEOROLOGY", "G07D": "HANDLING OF COINS OR VALUABLE PAPERS, e.g. TESTING, SORTING BY DENOMINATIONS, COUNTING, DISPENSING, CHANGING OR DEPOSITING", "Y02W": "CLIMATE CHANGE MITIGATION TECHNOLOGIES RELATED TO WASTEWATER TREATMENT OR WASTE MANAGEMENT", "B60C": "VEHICLE TYRES", "H02N": "ELECTRIC MACHINES NOT OTHERWISE PROVIDED FOR", "C10M": "LUBRICATING COMPOSITIONS", "F23J": "REMOVAL OR TREATMENT OF COMBUSTION PRODUCTS OR COMBUSTION RESIDUES", "B25D": "PERCUSSIVE TOOLS", "A61B": "DIAGNOSIS", "B24D": "TOOLS FOR GRINDING, BUFFING OR SHARPENING", "C08G": "MACROMOLECULAR COMPOUNDS OBTAINED OTHERWISE THAN BY REACTIONS ONLY INVOLVING UNSATURATED CARBON-TO-CARBON BONDS", "F04F": "PUMPING OF FLUID BY DIRECT CONTACT OF ANOTHER FLUID OR BY USING INERTIA OF FLUID TO BE PUMPED", "G10C": "PIANOS, HARPSICHORDS, SPINETS OR SIMILAR STRINGED MUSICAL INSTRUMENTS WITH ONE OR MORE KEYBOARDS", "F02G": "HOT GAS OR COMBUSTION-PRODUCT POSITIVE-DISPLACEMENT ENGINE PLANTS", "B06B": "METHODS OR APPARATUS FOR GENERATING OR TRANSMITTING MECHANICAL VIBRATIONS OF INFRASONIC, SONIC, OR ULTRASONIC FREQUENCY,", "B60W": "CONJOINT CONTROL OF VEHICLE SUB-UNITS OF DIFFERENT TYPE OR DIFFERENT FUNCTION", "A01G": "HORTICULTURE", "D21H": "PULP COMPOSITIONS", "G01M": "TESTING STATIC OR DYNAMIC BALANCE OF MACHINES OR STRUCTURES", "A23Y": "INDEXING SCHEME RELATING TO LACTIC OR PROPIONIC ACID BACTERIA USED IN FOODSTUFFS OR FOOD PREPARATION", "F25D": "REFRIGERATORS", "C02F": "TREATMENT OF WATER, WASTE WATER, SEWAGE, OR SLUDGE", "E04G": "SCAFFOLDING", "H04W": "WIRELESS COMMUNICATION NETWORKS", "B05B": "SPRAYING APPARATUS", "G01R": "MEASURING ELECTRIC VARIABLES", "C23G": "CLEANING OR DEGREASING OF METALLIC MATERIAL BY CHEMICAL METHODS OTHER THAN ELECTROLYSIS", "B25C": "HAND-HELD NAILING OR STAPLING TOOLS", "B26F": "PERFORATING", "E05C": "BOLTS OR FASTENING DEVICES FOR WINGS, SPECIALLY FOR DOORS OR WINDOWS", "H01C": "RESISTORS", "F02N": "STARTING OF COMBUSTION ENGINES", "H01S": "DEVICES USING THE PROCESS OF LIGHT AMPLIFICATION BY STIMULATED EMISSION OF RADIATION [LASER] TO AMPLIFY OR GENERATE LIGHT", "H03F": "AMPLIFIERS", "H01M": "PROCESSES OR MEANS, e.g. BATTERIES, FOR THE DIRECT CONVERSION OF CHEMICAL ENERGY INTO ELECTRICAL ENERGY", "B05C": "APPARATUS FOR APPLYING FLUENT MATERIALS TO SURFACES, IN GENERAL", "B60P": "VEHICLES ADAPTED FOR LOAD TRANSPORTATION OR TO TRANSPORT, TO CARRY, OR TO COMPRISE SPECIAL LOADS OR OBJECTS", "F28D": "HEAT-EXCHANGE APPARATUS, NOT PROVIDED FOR IN ANOTHER SUBCLASS, IN WHICH THE HEAT-EXCHANGE MEDIA DO NOT COME INTO DIRECT CONTACT", "B21B": "ROLLING OF METAL", "B41J": "TYPEWRITERS", "A22C": "PROCESSING MEAT, POULTRY, OR FISH", "B30B": "PRESSES IN GENERAL", "C07K": "PEPTIDES", "B60S": "SERVICING, CLEANING, REPAIRING, SUPPORTING, LIFTING, OR MANOEUVRING OF VEHICLES, NOT OTHERWISE PROVIDED FOR", "C08J": "WORKING-UP", "G21F": "PROTECTION AGAINST X-RADIATION, GAMMA RADIATION, CORPUSCULAR RADIATION OR PARTICLE BOMBARDMENT", "F05C": "INDEXING SCHEME RELATING TO MATERIALS, MATERIAL PROPERTIES OR MATERIAL CHARACTERISTICS FOR MACHINES, ENGINES OR PUMPS OTHER THAN NON-POSITIVE-DISPLACEMENT MACHINES OR ENGINES", "F03C": "POSITIVE-DISPLACEMENT ENGINES DRIVEN BY LIQUIDS", "A61Q": "SPECIFIC USE OF COSMETICS OR SIMILAR TOILET PREPARATIONS", "D10B": "INDEXING SCHEME ASSOCIATED WITH SUBLASSES OF SECTION", "H04M": "TELEPHONIC COMMUNICATION", "B26D": "CUTTING", "E05B": "LOCKS", "B60Y": "INDEXING SCHEME RELATING TO ASPECTS CROSS-CUTTING VEHICLE TECHNOLOGY", "Y02P": "CLIMATE CHANGE MITIGATION TECHNOLOGIES IN THE PRODUCTION OR PROCESSING OF GOODS", "A61G": "TRANSPORT, PERSONAL CONVEYANCES, OR ACCOMMODATION SPECIALLY ADAPTED FOR PATIENTS OR DISABLED PERSONS", "C08L": "COMPOSITIONS OF MACROMOLECULAR COMPOUNDS", "F16L": "PIPES", "B03C": "MAGNETIC OR ELECTROSTATIC SEPARATION OF SOLID MATERIALS FROM SOLID MATERIALS OR FLUIDS", "C07F": "ACYCLIC, CARBOCYCLIC OR HETEROCYCLIC COMPOUNDS CONTAINING ELEMENTS OTHER THAN CARBON, HYDROGEN, HALOGEN, OXYGEN, NITROGEN, SULFUR, SELENIUM OR TELLURIUM", "G06F": "ELECTRIC DIGITAL DATA PROCESSING", "G09G": "ARRANGEMENTS OR CIRCUITS FOR CONTROL OF INDICATING DEVICES USING STATIC MEANS TO PRESENT VARIABLE INFORMATION", "F01K": "STEAM ENGINE PLANTS", "F16D": "COUPLINGS FOR TRANSMITTING ROTATION", "H01G": "CAPACITORS", "G06M": "COUNTING MECHANISMS", "A45C": "PURSES", "B28D": "WORKING STONE OR STONE-LIKE MATERIALS", "H03J": "TUNING RESONANT CIRCUITS", "F24D": "DOMESTIC- OR SPACE-HEATING SYSTEMS, e.g. CENTRAL HEATING SYSTEMS", "B61F": "RAIL VEHICLE SUSPENSIONS, e.g. UNDERFRAMES, BOGIES OR ARRANGEMENTS OF WHEEL AXLES", "B09C": "RECLAMATION OF CONTAMINATED SOIL", "D01F": "CHEMICAL FEATURES IN THE MANUFACTURE OF ARTIFICIAL FILAMENTS, THREADS, FIBRES, BRISTLES OR RIBBONS", "F16H": "GEARING", "G16B": "BIOINFORMATICS, i.e. INFORMATION AND COMMUNICATION TECHNOLOGY [ICT] SPECIALLY ADAPTED FOR GENETIC OR PROTEIN-RELATED DATA PROCESSING IN COMPUTATIONAL MOLECULAR BIOLOGY", "A23B": "PRESERVING, e.g. BY CANNING, MEAT, FISH, EGGS, FRUIT, VEGETABLES, EDIBLE SEEDS", "Y10S": "TECHNICAL SUBJECTS COVERED BY FORMER USPC CROSS-REFERENCE ART COLLECTIONS [XRACs] AND DIGESTS", "G04C": "ELECTROMECHANICAL CLOCKS OR WATCHES", "G16C": "COMPUTATIONAL CHEMISTRY", "C11C": "FATTY ACIDS FROM FATS, OILS OR WAXES", "G06N": "COMPUTING ARRANGEMENTS BASED ON SPECIFIC COMPUTATIONAL MODELS", "B23D": "PLANING", "B21F": "WORKING OR PROCESSING OF METAL WIRE", "H04B": "TRANSMISSION", "H05G": "X-RAY TECHNIQUE", "F02D": "CONTROLLING COMBUSTION ENGINES", "E02B": "HYDRAULIC ENGINEERING", "F41H": "ARMOUR", "A41D": "OUTERWEAR", "B63B": "SHIPS OR OTHER WATERBORNE VESSELS", "C23F": "NON-MECHANICAL REMOVAL OF METALLIC MATERIAL FROM SURFACE", "A01H": "NEW PLANTS OR", "F42B": "EXPLOSIVE CHARGES, e.g. FOR BLASTING, FIREWORKS, AMMUNITION", "G03D": "APPARATUS FOR PROCESSING EXPOSED PHOTOGRAPHIC MATERIALS", "G06T": "IMAGE DATA PROCESSING OR GENERATION, IN GENERAL", "H04N": "PICTORIAL COMMUNICATION, e.g. TELEVISION", "B62L": "BRAKES SPECIALLY ADAPTED FOR CYCLES", "A45D": "HAIRDRESSING OR SHAVING EQUIPMENT", "B60T": "VEHICLE BRAKE CONTROL SYSTEMS OR PARTS THEREOF", "C06D": "MEANS FOR GENERATING SMOKE OR MIST", "A61L": "METHODS OR APPARATUS FOR STERILISING MATERIALS OR OBJECTS IN GENERAL", "A43B": "CHARACTERISTIC FEATURES OF FOOTWEAR", "C04B": "LIME, MAGNESIA", "E03F": "SEWERS", "H04Q": "SELECTING", "C01C": "AMMONIA", "B66C": "CRANES", "F16J": "PISTONS", "F15B": "SYSTEMS ACTING BY MEANS OF FLUIDS IN GENERAL", "G04G": "ELECTRONIC TIME-PIECES", "C09D": "COATING COMPOSITIONS, e.g. PAINTS, VARNISHES OR LACQUERS", "B21H": "MAKING PARTICULAR METAL OBJECTS BY ROLLING, e.g. SCREWS, WHEELS, RINGS, BARRELS, BALLS", "F01N": "GAS-FLOW SILENCERS OR EXHAUST APPARATUS FOR MACHINES OR ENGINES IN GENERAL", "G10D": "STRINGED MUSICAL INSTRUMENTS", "A42B": "HATS", "G09F": "DISPLAYING", "A45F": "TRAVELLING OR CAMP EQUIPMENT: SACKS OR PACKS CARRIED ON THE BODY", "C21D": "MODIFYING THE PHYSICAL STRUCTURE OF FERROUS METALS", "H02M": "APPARATUS FOR CONVERSION BETWEEN AC AND AC, BETWEEN AC AND DC, OR BETWEEN DC AND DC, AND FOR USE WITH MAINS OR SIMILAR POWER SUPPLY SYSTEMS", "B22F": "WORKING METALLIC POWDER", "C07J": "STEROIDS", "B65H": "HANDLING THIN OR FILAMENTARY MATERIAL, e.g. SHEETS, WEBS, CABLES", "B43K": "IMPLEMENTS FOR WRITING OR DRAWING", "H05K": "PRINTED CIRCUITS", "A63H": "TOYS, e.g. TOPS, DOLLS, HOOPS OR BUILDING BLOCKS", "B62J": "CYCLE SADDLES OR SEATS", "H04R": "LOUDSPEAKERS, MICROPHONES, GRAMOPHONE PICK-UPS OR LIKE ACOUSTIC ELECTROMECHANICAL TRANSDUCERS", "G21D": "NUCLEAR POWER PLANT", "F16N": "LUBRICATING", "C22F": "CHANGING THE PHYSICAL STRUCTURE OF NON-FERROUS METALS AND NON-FERROUS ALLOYS", "H02B": "BOARDS, SUBSTATIONS, OR SWITCHING ARRANGEMENTS FOR THE SUPPLY OR DISTRIBUTION OF ELECTRIC POWER", "E03D": "WATER-CLOSETS OR URINALS WITH FLUSHING DEVICES", "C12M": "APPARATUS FOR ENZYMOLOGY OR MICROBIOLOGY", "B42C": "BOOKBINDING", "A61J": "CONTAINERS SPECIALLY ADAPTED FOR MEDICAL OR PHARMACEUTICAL PURPOSES", "A41C": "CORSETS", "B60M": "POWER SUPPLY LINES, AND DEVICES ALONG RAILS, FOR ELECTRICALLY- PROPELLED VEHICLES", "D02G": "CRIMPING OR CURLING FIBRES, FILAMENTS, THREADS, OR YARNS", "C08B": "POLYSACCHARIDES", "B65G": "TRANSPORT OR STORAGE DEVICES, e.g. CONVEYORS FOR LOADING OR TIPPING, SHOP CONVEYOR SYSTEMS OR PNEUMATIC TUBE CONVEYORS", "F21S": "NON-PORTABLE LIGHTING DEVICES", "G03G": "ELECTROGRAPHY", "B29D": "PRODUCING PARTICULAR ARTICLES FROM PLASTICS OR FROM SUBSTANCES IN A PLASTIC STATE", "G01G": "WEIGHING", "D07B": "ROPES OR CABLES IN GENERAL", "B27B": "SAWS FOR WOOD OR SIMILAR MATERIAL", "B65D": "CONTAINERS FOR STORAGE OR TRANSPORT OF ARTICLES OR MATERIALS, e.g. BAGS, BARRELS, BOTTLES, BOXES, CANS, CARTONS, CRATES, DRUMS, JARS, TANKS, HOPPERS, FORWARDING CONTAINERS", "H03H": "IMPEDANCE NETWORKS, e.g. RESONANT CIRCUITS", "C21C": "PROCESSING OF PIG-IRON, e.g. REFINING, MANUFACTURE OF WROUGHT-IRON OR STEEL", "D04B": "KNITTING", "F23C": "METHODS OR APPARATUS FOR COMBUSTION USING FLUID FUEL OR SOLID FUEL SUSPENDED IN", "A23F": "COFFEE", "G06Q": "DATA PROCESSING SYSTEMS OR METHODS, SPECIALLY ADAPTED FOR ADMINISTRATIVE, COMMERCIAL, FINANCIAL, MANAGERIAL, SUPERVISORY OR FORECASTING PURPOSES", "A23V": "INDEXING SCHEME RELATING TO FOODS, FOODSTUFFS OR NON-ALCOHOLIC BEVERAGES", "B01D": "SEPARATION", "C25C": "PROCESSES FOR THE ELECTROLYTIC PRODUCTION, RECOVERY OR REFINING OF METALS", "D02J": "FINISHING OR DRESSING OF FILAMENTS, YARNS, THREADS, CORDS, ROPES OR THE LIKE", "C01B": "NON-METALLIC ELEMENTS", "F17C": "VESSELS FOR CONTAINING OR STORING COMPRESSED, LIQUEFIED OR SOLIDIFIED GASES", "D06F": "LAUNDERING, DRYING, IRONING, PRESSING OR FOLDING TEXTILE ARTICLES", "F01L": "CYCLICALLY OPERATING VALVES FOR MACHINES OR ENGINES", "B21C": "MANUFACTURE OF METAL SHEETS, WIRE, RODS, TUBES OR PROFILES, OTHERWISE THAN BY ROLLING", "H03B": "GENERATION OF OSCILLATIONS, DIRECTLY OR BY FREQUENCY-CHANGING, BY CIRCUITS EMPLOYING ACTIVE ELEMENTS WHICH OPERATE IN A NON-SWITCHING MANNER", "G01J": "MEASUREMENT OF INTENSITY, VELOCITY, SPECTRAL CONTENT, POLARISATION, PHASE OR PULSE CHARACTERISTICS OF INFRA-RED, VISIBLE OR ULTRA-VIOLET LIGHT", "G01D": "MEASURING NOT SPECIALLY ADAPTED FOR A SPECIFIC VARIABLE", "H05F": "STATIC ELECTRICITY", "A61P": "SPECIFIC THERAPEUTIC ACTIVITY OF CHEMICAL COMPOUNDS OR MEDICINAL PREPARATIONS", "F23G": "CREMATION FURNACES", "G02F": "OPTICAL DEVICES OR ARRANGEMENTS FOR THE CONTROL OF LIGHT BY MODIFICATION OF THE OPTICAL PROPERTIES OF THE MEDIA OF THE ELEMENTS INVOLVED THEREIN", "G10H": "ELECTROPHONIC MUSICAL INSTRUMENTS", "E04F": "FINISHING WORK ON BUILDINGS, e.g. STAIRS, FLOORS", "A61D": "VETERINARY INSTRUMENTS, IMPLEMENTS, TOOLS, OR METHODS", "B42D": "BOOKS", "B67C": "CLEANING, FILLING WITH LIQUIDS OR SEMILIQUIDS, OR EMPTYING, OF BOTTLES, JARS, CANS, CASKS, BARRELS, OR SIMILAR CONTAINERS, NOT OTHERWISE PROVIDED FOR", "C08F": "MACROMOLECULAR COMPOUNDS OBTAINED BY REACTIONS ONLY INVOLVING CARBON-TO-CARBON UNSATURATED BONDS", "F17D": "PIPE-LINE SYSTEMS", "E02D": "FOUNDATIONS", "F04B": "POSITIVE-DISPLACEMENT MACHINES FOR LIQUIDS", "F21K": "NON-ELECTRIC LIGHT SOURCES USING LUMINESCENCE", "C08H": "DERIVATIVES OF NATURAL MACROMOLECULAR COMPOUNDS", "F23K": "FEEDING FUEL TO COMBUSTION APPARATUS", "H05H": "PLASMA TECHNIQUE", "B64G": "COSMONAUTICS", "B61L": "GUIDING RAILWAY TRAFFIC", "B44C": "PRODUCING DECORATIVE EFFECTS", "C01F": "COMPOUNDS OF THE METALS BERYLLIUM, MAGNESIUM, ALUMINIUM, CALCIUM, STRONTIUM, BARIUM, RADIUM, THORIUM, OR OF THE RARE-EARTH METALS", "G08C": "TRANSMISSION SYSTEMS FOR MEASURED VALUES, CONTROL OR SIMILAR SIGNALS", "C07C": "ACYCLIC OR CARBOCYCLIC COMPOUNDS", "G03F": "PHOTOMECHANICAL PRODUCTION OF TEXTURED OR PATTERNED SURFACES, e.g. FOR PRINTING, FOR PROCESSING OF SEMICONDUCTOR DEVICES", "B60D": "VEHICLE CONNECTIONS", "A01D": "HARVESTING", "F04D": "NON-POSITIVE-DISPLACEMENT PUMPS", "C10G": "CRACKING HYDROCARBON OILS", "B26B": "HAND-HELD CUTTING TOOLS NOT OTHERWISE PROVIDED FOR", "A62D": "CHEMICAL MEANS FOR EXTINGUISHING FIRES OR FOR COMBATING OR PROTECTING AGAINST HARMFUL CHEMICAL AGENTS", "F23L": "SUPPLYING AIR OR NON-COMBUSTIBLE LIQUIDS OR GASES TO COMBUSTION APPARATUS IN GENERAL", "E03C": "DOMESTIC PLUMBING INSTALLATIONS FOR FRESH WATER OR WASTE WATER", "H02G": "INSTALLATION OF ELECTRIC CABLES OR LINES, OR OF COMBINED OPTICAL AND ELECTRIC CABLES OR LINES", "B28B": "SHAPING CLAY OR OTHER CERAMIC COMPOSITIONS", "F03D": "WIND MOTORS", "A47G": "HOUSEHOLD OR TABLE EQUIPMENT", "D03D": "WOVEN FABRICS", "E01B": "PERMANENT WAY", "A61N": "ELECTROTHERAPY", "E01F": "ADDITIONAL WORK, SUCH AS EQUIPPING ROADS OR THE CONSTRUCTION OF PLATFORMS, HELICOPTER LANDING STAGES, SIGNS, SNOW FENCES, OR THE LIKE", "F24C": "DOMESTIC STOVES OR RANGES", "C23C": "COATING METALLIC MATERIAL", "E04H": "BUILDINGS OR LIKE STRUCTURES FOR PARTICULAR PURPOSES", "H03G": "CONTROL OF AMPLIFICATION", "H03M": "CODING", "B60L": "PROPULSION OF ELECTRICALLY-PROPELLED VEHICLES", "A21C": "MACHINES OR EQUIPMENT FOR MAKING OR PROCESSING DOUGHS", "C09B": "ORGANIC DYES OR CLOSELY-RELATED COMPOUNDS FOR PRODUCING DYES", "G01L": "MEASURING FORCE, STRESS, TORQUE, WORK, MECHANICAL POWER, MECHANICAL EFFICIENCY, OR FLUID PRESSURE", "B01L": "CHEMICAL OR PHYSICAL LABORATORY APPARATUS FOR GENERAL USE", "B01F": "MIXING, e.g. DISSOLVING, EMULSIFYING OR DISPERSING", "F23M": "CASINGS, LININGS, WALLS OR DOORS SPECIALLY ADAPTED FOR COMBUSTION CHAMBERS, e.g. FIREBRIDGES", "G04R": "RADIO-CONTROLLED TIME-PIECES", "C10N": "INDEXING SCHEME ASSOCIATED WITH SUBCLASS", "F25C": "PRODUCING, WORKING OR HANDLING ICE", "F24S": "SOLAR HEAT COLLECTORS", "F16B": "DEVICES FOR FASTENING OR SECURING CONSTRUCTIONAL ELEMENTS OR MACHINE PARTS TOGETHER, e.g. NAILS, BOLTS, CIRCLIPS, CLAMPS, CLIPS, WEDGES, JOINTS OR JOINTING", "B02C": "CRUSHING, PULVERISING, OR DISINTEGRATING IN GENERAL", "H04K": "SECRET COMMUNICATION", "A46B": "BRUSHES", "B21D": "WORKING OR PROCESSING OF SHEET METAL OR METAL TUBES, RODS OR PROFILES WITHOUT ESSENTIALLY REMOVING MATERIAL", "G10G": "REPRESENTATION OF MUSIC", "C08K": "Use of inorganic or non-macromolecular organic substances as compounding ingredients", "H03K": "PULSE TECHNIQUE", "G05B": "CONTROL OR REGULATING SYSTEMS IN GENERAL", "G01B": "MEASURING LENGTH, THICKNESS OR SIMILAR LINEAR DIMENSIONS", "Y04S": "SYSTEMS INTEGRATING TECHNOLOGIES RELATED TO POWER NETWORK OPERATION, COMMUNICATION OR INFORMATION TECHNOLOGIES FOR IMPROVING THE ELECTRICAL POWER GENERATION, TRANSMISSION, DISTRIBUTION, MANAGEMENT OR USAGE, i.e. SMART GRIDS", "C07B": "GENERAL METHODS OF ORGANIC CHEMISTRY", "A62B": "DEVICES, APPARATUS OR METHODS FOR LIFE-SAVING", "A47L": "DOMESTIC WASHING OR CLEANING", "D21F": "PAPER-MAKING MACHINES", "B25B": "TOOLS OR BENCH DEVICES NOT OTHERWISE PROVIDED FOR, FOR FASTENING, CONNECTING, DISENGAGING OR HOLDING", "F25J": "LIQUEFACTION, SOLIDIFICATION OR SEPARATION OF GASES OR GASEOUS", "F24H": "FLUID HEATERS, e.g. WATER OR AIR HEATERS, HAVING HEAT-GENERATING MEANS, e.g. HEAT PUMPS, IN GENERAL", "G03C": "PHOTOSENSITIVE MATERIALS FOR PHOTOGRAPHIC PURPOSES", "C12N": "MICROORGANISMS OR ENZYMES", "B60H": "ARRANGEMENTS OF HEATING, COOLING, VENTILATING OR OTHER AIR-TREATING DEVICES SPECIALLY ADAPTED FOR PASSENGER OR GOODS SPACES OF VEHICLES", "G01P": "MEASURING LINEAR OR ANGULAR SPEED, ACCELERATION, DECELERATION, OR SHOCK", "D05D": "INDEXING SCHEME ASSOCIATED WITH SUBCLASSES", "B22D": "CASTING OF METALS", "G10L": "SPEECH ANALYSIS OR SYNTHESIS", "F41C": "SMALLARMS, e.g. PISTOLS, RIFLES", "C30B": "SINGLE-CRYSTAL GROWTH", "G21K": "TECHNIQUES FOR HANDLING PARTICLES OR IONISING RADIATION NOT OTHERWISE PROVIDED FOR", "G01F": "MEASURING VOLUME, VOLUME FLOW, MASS FLOW OR LIQUID LEVEL", "B29C": "SHAPING OR JOINING OF PLASTICS", "B81C": "PROCESSES OR APPARATUS SPECIALLY ADAPTED FOR THE MANUFACTURE OR TREATMENT OF MICROSTRUCTURAL DEVICES OR SYSTEMS", "A62C": "FIRE-FIGHTING", "F24F": "AIR-CONDITIONING", "F25B": "REFRIGERATION MACHINES, PLANTS OR SYSTEMS", "Y02T": "CLIMATE CHANGE MITIGATION TECHNOLOGIES RELATED TO TRANSPORTATION", "A21B": "BAKERS' OVENS", "B41C": "PROCESSES FOR THE MANUFACTURE OR REPRODUCTION OF PRINTING SURFACES", "C09C": "TREATMENT OF INORGANIC MATERIALS, OTHER THAN FIBROUS FILLERS, TO ENHANCE THEIR PIGMENTING OR FILLING PROPERTIES", "E21B": "EARTH DRILLING, e.g. DEEP DRILLING", "F23Q": "IGNITION", "A61F": "FILTERS IMPLANTABLE INTO BLOOD VESSELS", "B25J": "MANIPULATORS", "B62M": "RIDER PROPULSION OF WHEELED VEHICLES OR SLEDGES", "H01F": "MAGNETS", "H04J": "MULTIPLEX COMMUNICATION", "B23Q": "DETAILS, COMPONENTS, OR ACCESSORIES FOR MACHINE TOOLS, e.g. ARRANGEMENTS FOR COPYING OR CONTROLLING", "A61M": "DEVICES FOR INTRODUCING MEDIA INTO, OR ONTO, THE BODY", "D06C": "FINISHING, DRESSING, TENTERING OR STRETCHING TEXTILE FABRICS", "A61H": "PHYSICAL THERAPY APPARATUS, e.g. DEVICES FOR LOCATING OR STIMULATING REFLEX POINTS IN THE BODY", "G09C": "CIPHERING OR DECIPHERING APPARATUS FOR CRYPTOGRAPHIC OR OTHER PURPOSES INVOLVING THE NEED FOR SECRECY", "B63H": "MARINE PROPULSION OR STEERING", "A41G": "ARTIFICIAL FLOWERS", "D05C": "EMBROIDERING", "C11D": "DETERGENT COMPOSITIONS", "G16H": "HEALTHCARE INFORMATICS, i.e. INFORMATION AND COMMUNICATION TECHNOLOGY [ICT] SPECIALLY ADAPTED FOR THE HANDLING OR PROCESSING OF MEDICAL OR HEALTHCARE DATA", "B25G": "HANDLES FOR HAND IMPLEMENTS", "C03B": "MANUFACTURE, SHAPING, OR SUPPLEMENTARY PROCESSES", "A63G": "MERRY-GO-ROUNDS", "A61C": "DENTISTRY", "B29B": "PREPARATION OR PRETREATMENT OF THE MATERIAL TO BE SHAPED", "G03B": "APPARATUS OR ARRANGEMENTS FOR TAKING PHOTOGRAPHS OR FOR PROJECTING OR VIEWING THEM", "A47K": "SANITARY EQUIPMENT NOT OTHERWISE PROVIDED FOR", "A63F": "CARD, BOARD, OR ROULETTE GAMES", "B23K": "SOLDERING OR UNSOLDERING", "H04S": "STEREOPHONIC SYSTEMS", "B23F": "MAKING GEARS OR TOOTHED RACKS", "F22B": "METHODS OF STEAM GENERATION", "H01J": "ELECTRIC DISCHARGE TUBES OR DISCHARGE LAMPS", "B61B": "RAILWAY SYSTEMS", "B62D": "MOTOR VEHICLES", "C12P": "FERMENTATION OR ENZYME-USING PROCESSES TO SYNTHESISE A DESIRED CHEMICAL COMPOUND OR COMPOSITION OR TO SEPARATE OPTICAL ISOMERS FROM A RACEMIC MIXTURE", "H01L": "SEMICONDUCTOR DEVICES", "G07F": "COIN-FREED OR LIKE APPARATUS", "B27N": "MANUFACTURE BY DRY PROCESSES OF ARTICLES, WITH OR WITHOUT ORGANIC BINDING AGENTS, MADE FROM PARTICLES OR FIBRES CONSISTING OF WOOD OR OTHER LIGNOCELLULOSIC OR LIKE ORGANIC MATERIAL", "B42F": "SHEETS TEMPORARILY ATTACHED TOGETHER", "E01H": "STREET CLEANING", "A44B": "BUTTONS, PINS, BUCKLES, SLIDE FASTENERS, OR THE LIKE", "F23D": "BURNERS", "Y02C": "CAPTURE, STORAGE, SEQUESTRATION OR DISPOSAL OF GREENHOUSE GASES [GHG]", "B25H": "WORKSHOP EQUIPMENT, e.g. FOR MARKING-OUT WORK", "A23J": "PROTEIN COMPOSITIONS FOR FOODSTUFFS", "B64D": "EQUIPMENT FOR FITTING IN OR TO AIRCRAFT", "F02B": "INTERNAL-COMBUSTION PISTON ENGINES", "B62B": "HAND-PROPELLED VEHICLES, e.g. HAND CARTS OR PERAMBULATORS", "D01D": "MECHANICAL METHODS OR APPARATUS IN THE MANUFACTURE OF ARTIFICIAL FILAMENTS, THREADS, FIBRES, BRISTLES OR RIBBONS", "C12Q": "MEASURING OR TESTING PROCESSES INVOLVING ENZYMES, NUCLEIC ACIDS OR MICROORGANISMS", "G02C": "SPECTACLES", "D05B": "SEWING", "A24B": "MANUFACTURE OR PREPARATION OF TOBACCO FOR SMOKING OR CHEWING", "G06G": "ANALOGUE COMPUTERS", "H01Q": "ANTENNAS, i.e. RADIO AERIALS", "B22C": "FOUNDRY MOULDING", "B01J": "CHEMICAL OR PHYSICAL PROCESSES, e.g. CATALYSIS OR COLLOID CHEMISTRY", "B24B": "MACHINES, DEVICES, OR PROCESSES FOR GRINDING OR POLISHING", "F28F": "DETAILS OF HEAT-EXCHANGE AND HEAT-TRANSFER APPARATUS, OF GENERAL APPLICATION", "D06N": "WALL, FLOOR, OR LIKE COVERING MATERIALS, e.g. LINOLEUM, OILCLOTH, ARTIFICIAL LEATHER, ROOFING FELT, CONSISTING OF A FIBROUS WEB COATED WITH A LAYER OF MACROMOLECULAR MATERIAL", "G09B": "EDUCATIONAL OR DEMONSTRATION APPLIANCES", "A41B": "SHIRTS", "C07D": "HETEROCYCLIC COMPOUNDS", "A23D": "EDIBLE OILS OR FATS, e.g. MARGARINES, SHORTENINGS, COOKING OILS", "E02F": "DREDGING", "G11C": "STATIC STORES", "B09B": "DISPOSAL OF SOLID WASTE", "B61C": "LOCOMOTIVES", "A01M": "CATCHING, TRAPPING OR SCARING OF ANIMALS", "C22C": "ALLOYS", "A23K": "FODDER", "B41F": "PRINTING MACHINES OR PRESSES", "B32B": "LAYERED PRODUCTS, i.e. PRODUCTS BUILT-UP OF STRATA OF FLAT OR NON-FLAT, e.g. CELLULAR OR HONEYCOMB, FORM", "A24D": "CIGARS", "B42B": "PERMANENTLY ATTACHING TOGETHER SHEETS, QUIRES OR SIGNATURES OR PERMANENTLY ATTACHING OBJECTS THERETO", "A47C": "CHAIRS", "B29K": "INDEXING SCHEME ASSOCIATED WITH SUBCLASSES", "C12R": "INDEXING SCHEME ASSOCIATED WITH SUBCLASSES", "H02J": "CIRCUIT ARRANGEMENTS OR SYSTEMS FOR SUPPLYING OR DISTRIBUTING ELECTRIC POWER", "D01H": "SPINNING OR TWISTING", "F05B": "INDEXING SCHEME RELATING TO WIND, SPRING, WEIGHT, INERTIA OR LIKE MOTORS, TO MACHINES OR ENGINES FOR LIQUIDS COVERED BY SUBCLASSES", "B60N": "SEATS SPECIALLY ADAPTED FOR VEHICLES", "F16F": "SPRINGS", "F21Y": "INDEXING SCHEME ASSOCIATED WITH SUBCLASSES", "G01V": "GEOPHYSICS", "D21C": "PRODUCTION OF CELLULOSE BY REMOVING NON-CELLULOSE SUBSTANCES FROM CELLULOSE-CONTAINING MATERIALS", "B62H": "CYCLE STANDS", "F03G": "SPRING, WEIGHT, INERTIA OR LIKE MOTORS", "F21W": "INDEXING SCHEME ASSOCIATED WITH SUBCLASSES", "B23H": "WORKING OF METAL BY THE ACTION OF A HIGH CONCENTRATION OF ELECTRIC CURRENT ON A WORKPIECE USING AN ELECTRODE WHICH TAKES THE PLACE OF A TOOL", "G01H": "MEASUREMENT OF MECHANICAL VIBRATIONS OR ULTRASONIC, SONIC OR INFRASONIC WAVES", "B65C": "LABELLING OR TAGGING MACHINES, APPARATUS, OR PROCESSES", "G07C": "TIME OR ATTENDANCE REGISTERS", "Y02B": "CLIMATE CHANGE MITIGATION TECHNOLOGIES RELATED TO BUILDINGS, e.g. HOUSING, HOUSE APPLIANCES OR RELATED END-USER APPLICATIONS", "B66F": "HOISTING, LIFTING, HAULING OR PUSHING, NOT OTHERWISE PROVIDED FOR, e.g. DEVICES WHICH APPLY A LIFTING OR PUSHING FORCE DIRECTLY TO THE SURFACE OF A LOAD", "F01P": "COOLING OF MACHINES OR ENGINES IN GENERAL"}